module.exports = class Marks {
  punctuation = [')','(','>','<',"؛","،",'{','}',"؟",':',"-", '»', '"', '«', '[', ']','"','+','=','?']
  marks = ['/','//', '\\','|','!', '%', '&','*','$', '#','؟', '*','.','_' ]
  alphabet_string_lower = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q','r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
  alphabet_string_upper = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q','R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
  english_char = this.alphabet_string_lower.concat(this.alphabet_string_upper)
  stopwords = ['در','تا','از','با','که','و','را','به','اما','بر','اخر','حداقل','حتی','حتما','حالی','حالا','حال','جهت','جلوتر','جلو','جز','جدی','توی','توسط','تقریبا','تدریجی','تدریج','تاکنون','تحت','تاحدودی','تاحدی','بیشتر','بیش','بهش','بهتر','بهت','بمراتب','بله','بلکه','بلافاصله','بعضی','بعدی','بعدا','بعد','بصورت','بسیار','بسا','بس','برخلاف','برای','براثر','بر','بدین','بدون','بجای','بخاطر','بااطمینان','باانکه','اگرچه','آن','ان','امیدوارم','امسال','امروزه','امروز','الی','اکثرا','اغلب','اصطلاحا','اصلا','است','اساسا','ازقبیل','ازان','ازش','ازاینرو','ازاین','ازان','اره']
  sep_list = [" ", '\xad', '\u200e','\u200f', '\u200d', '\u200d', '\u200d'].concat(this.marks)
}
  
