module.exports = class Verbs {

    present_roots =['توان','باش','رو','بر','یاور', 'یانداز', 'یای','یاندیش','بخش','باز','خر','بین','شنو','دار','دان','رسان','شناس','گو','گذار','یاب','لرز','ساز','شو','نویس','خوان','کاه','گیر','خواه','کن' ]
    past_roots = ['توانست','بود','کرد','اورد','انداخت','امد','خرید','باخت','برد','رفت','اندیشید','بخشید','دید','شنید','داشت','دانست','رساند','شناخت','گفت','گذشت','یافت','لرزید','ساخت','شد','نوشت','خواند','کاست','گرفت','خواست']
    all_verbs_roots = this.present_roots.concat(this.past_roots)
    empty_list = ['','','','','','','']
    verb_prefix = ['نمی‌', 'می‌','ن','ب',"" ]
    present_verb_postfix = ['م','ی','د','ید','ند','یم']
    past_verb_postfix = ['ایم','اید','ای','ام','اند']
    past_verb_postfix2 = ['م','ی','ید','ند','یم']
    words_list = ['ادب', 'آداب', 'طرف', 'اطراف', 'حقیقت', 'حقایق', 'موج', 'امواج', 'ادیب', 'ادبا', 'عمق', 'اعماق', 'خزینه', 'خزائن', 'مرکز', 'مراکز', 'اثر', 'آثار', 'عالم', 'علما', 'خبر', 'اخبار', 'موقع', 'مواقع', 'اسیر', 'اسرا', 'علم', 'علوم', 'دوره', 'ادوار', 'مصرف', 'مصارف', 'اسم', 'اسامی', 'علامت', 'علائم', 'دین', 'ادیان', 'معرفت', 'معارف', 'اسطوره', 'اساطیر', 'علت', 'علل', 'دفتر', 'دفاتر', 'مبحث', 'مباحث', 'امیر', 'امرا', 'عقیده', 'عقائد', 'ذخیره', 'ذخایر', 'ماده', 'مواد', 'امر', 'اوامر', 'عمل', 'اعمال', 'رفیق', 'رفقا', 'مذهب', 'مذاهب', 'امام', 'ائمه', 'عید', 'اعیاد', 'رای', 'آرا', 'مصیبت', 'مصائب', 'اصل', 'اصول', 'عنصر', 'عناصر', 'رسم', 'رسوم', 'معبد', 'معابد', 'افق', 'آفاق', 'عاطفه', 'عواطف', 'رابطه', 'روابط', 'مسجد', 'مساجد', 'بیت', 'ابیات', 'عضو', 'اعضا', 'رمز', 'رموز', 'معبر', 'معابر', 'تاجر', 'تجار', 'عبارت', 'عبارات', 'رجل', 'رجال', 'مظهر', 'مظاهر', 'تصویر', 'تصاویر', 'عجیب', 'عجایب', 'رقم', 'ارقام', 'منظره', 'مناظر', 'جد', 'اجداد', 'فقیه', 'فقها', 'زاویه', 'زوایا', 'مرض', 'امراض', 'جانب', 'جوانب', 'فن', 'فنون', 'زعیم', 'زعما', 'مورد', 'موارد', 'جزیره', 'جزایر', 'فکر', 'افکار', 'سانحه', 'سوانح', 'مرحله', 'مراحل', 'جبل', 'جبال', 'فریضه', 'فرایض', 'سلطان', 'سلاطین', 'مفهوم', 'مفاهیم', 'جریمه', 'جرایم', 'فعل', 'افعال', 'شعر', 'اشعار', 'منبع', 'منابع', 'حادثه', 'حوادث', 'فقیر', 'فقرا', 'شاعر', 'شعرا', 'مکان', 'اماکن', 'حشم', 'احشام', 'قاعده', 'قواعد']

    all_verbs() {
        let all_verbs = {}
        this.verb_prefix.map(pref => {
            for(let x=0 ; x<this.present_roots.length ; x++ ){
                let present_root = this.present_roots[x]
                this.present_verb_postfix.map(post => {
                    all_verbs[pref+present_root+post] = present_root
                })
            }
            for(let x=0 ; x<this.past_roots.length ; x++ ){
                let past_root = this.past_roots[x]
                this.past_verb_postfix.map(post => {
                    all_verbs[past_root+'ه‌'+post] = past_root
                })
                this.past_verb_postfix2.map(post => {
                    all_verbs[pref+past_root+post] = past_root
                })
            }
        })   
        //console.log(Object.keys(all_verbs).length)
        return all_verbs 
    }

    mokassar_dict(){
        let mokassar_dict ={}
        for(let i=0 ; i<this.words_list.length ; i=i+2){
            mokassar_dict[this.words_list[i+1]] = this.words_list[i] // قاعده <= قواعد
        } 
        return mokassar_dict
    }
  
}

